## Experiment Advertureworks database

In [1]:
%run connection.ipynb

Connecting with connection string : postgresql://postgres:letmein@db:5432/Adventureworks
 * postgresql://postgres:***@db:5432/Adventureworks
1 rows affected.
 * postgresql://postgres:***@db:5432/Adventureworks
1 rows affected.
 * postgresql://postgres:***@db:5432/Adventureworks
68 rows affected.

In [2]:
%%sql

WITH base_table AS (
    SELECT
        soh.customerid,
        (
            SELECT soh2.salesorderid FROM sales.salesorderheader soh2 WHERE soh2.salesorderid = MIN(soh.salesorderid)
        ) AS salesorderid

    FROM sales.salesorderheader soh

    GROUP BY 1
    ORDER BY 1
)

SELECT bt.*, soh3.orderdate FROM base_table bt
    LEFT JOIN sales.salesorderheader soh3 ON soh3.customerid = bt.customerid
    WHERE soh3.salesorderid = bt.salesorderid

 * postgresql://postgres:***@db:5432/Adventureworks
19119 rows affected.

       customerid  salesorderid  orderdate
0           11000         43793 2011-06-21
1           11001         43767 2011-06-17
2           11002         43736 2011-06-09
3           11003         43701 2011-05-31
4           11004         43810 2011-06-25
...           ...           ...        ...
19114       30114         46623 2012-05-30
19115       30115         46935 2012-06-30
19116       30116         51106 2013-05-30
19117       30117         43865 2011-07-01
19118       30118         47378 2012-07-31

[19119 rows x 3 columns]